#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.aws-route-53.aws_route53_record.notebook-shunkakinoki-com-CNAME must be replaced
-/+ resource "aws_route53_record" "notebook-shunkakinoki-com-CNAME" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "notebook.shunkakinoki.com" -> (known after apply)
      ~ id              = "Z19V0BNFYY29A_notebook_CNAME" -> (known after apply)
      ~ name            = "notebook" -> "notebook.shunkakinoki.com" # forces replacement
        records         = [
            "shunkakinoki.github.io",
        ]
        ttl             = 300
        type            = "CNAME"
        zone_id         = "Z19V0BNFYY29A"
    }

  # module.aws-route-53.aws_route53_record.shunblog-org-NS will be created
  + resource "aws_route53_record" "shunblog-org-NS" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "shunblog.org"
      + records         = [
          + "ns-1095.awsdns-08.org",
          + "ns-1683.awsdns-18.co.uk",
          + "ns-335.awsdns-41.com",
          + "ns-808.awsdns-37.net",
        ]
      + ttl             = 172800
      + type            = "NS"
      + zone_id         = "Z29GQ4UV60ZIAS"
    }

  # module.aws-route-53.aws_route53_record.wiki-shunkakinoki-com-CNAME must be replaced
-/+ resource "aws_route53_record" "wiki-shunkakinoki-com-CNAME" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "wiki.shunkakinoki.com" -> (known after apply)
      ~ id              = "Z19V0BNFYY29A_wiki_CNAME" -> (known after apply)
      ~ name            = "wiki" -> "wiki.shunkakinoki.com" # forces replacement
        records         = [
            "hosting.gitbook.com",
        ]
        ttl             = 300
        type            = "CNAME"
        zone_id         = "Z19V0BNFYY29A"
    }

  # module.aws-route-53.aws_route53_record.www-shunblog-org-CNAME must be replaced
-/+ resource "aws_route53_record" "www-shunblog-org-CNAME" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "www.shunblog.org" -> (known after apply)
      ~ id              = "Z29GQ4UV60ZIAS_www_CNAME" -> (known after apply)
      ~ name            = "www" -> "www.shunblog.org" # forces replacement
        records         = [
            "shunkakinoki.github.io",
        ]
        ttl             = 300
        type            = "CNAME"
        zone_id         = "Z29GQ4UV60ZIAS"
    }

  # module.aws-s3-bucket.aws_s3_bucket.shunkakinoki will be updated in-place
  ~ resource "aws_s3_bucket" "shunkakinoki" {
      + acl                         = "private"
        arn                         = "arn:aws:s3:::shunkakinoki"
        bucket                      = "shunkakinoki"
        bucket_domain_name          = "shunkakinoki.s3.amazonaws.com"
        bucket_regional_domain_name = "shunkakinoki.s3.amazonaws.com"
      + force_destroy               = false
        hosted_zone_id              = "Z3AQBSTGFYJSTF"
        id                          = "shunkakinoki"
        region                      = "us-east-1"
        request_payer               = "BucketOwner"
        tags                        = {}

        versioning {
            enabled    = false
            mfa_delete = false
        }
    }

  # module.aws-s3-bucket.aws_s3_bucket.shunkakinoki-com will be updated in-place
  ~ resource "aws_s3_bucket" "shunkakinoki-com" {
      + acl                         = "private"
        arn                         = "arn:aws:s3:::shunkakinoki.com"
        bucket                      = "shunkakinoki.com"
        bucket_domain_name          = "shunkakinoki.com.s3.amazonaws.com"
        bucket_regional_domain_name = "shunkakinoki.com.s3.amazonaws.com"
      + force_destroy               = false
        hosted_zone_id              = "Z3AQBSTGFYJSTF"
        id                          = "shunkakinoki.com"
        region                      = "us-east-1"
        request_payer               = "BucketOwner"
        tags                        = {}

        versioning {
            enabled    = false
            mfa_delete = false
        }
    }

  # module.aws-s3-bucket.aws_s3_bucket.shunkakinoki-workspace will be updated in-place
  ~ resource "aws_s3_bucket" "shunkakinoki-workspace" {
      + acl                         = "private"
        arn                         = "arn:aws:s3:::shunkakinoki-workspace"
        bucket                      = "shunkakinoki-workspace"
        bucket_domain_name          = "shunkakinoki-workspace.s3.amazonaws.com"
        bucket_regional_domain_name = "shunkakinoki-workspace.s3.amazonaws.com"
      + force_destroy               = false
        hosted_zone_id              = "Z3AQBSTGFYJSTF"
        id                          = "shunkakinoki-workspace"
        region                      = "us-east-1"
        request_payer               = "BucketOwner"
        tags                        = {}

        versioning {
            enabled    = false
            mfa_delete = false
        }
    }

  # module.aws-s3-bucket.aws_s3_bucket.www-shunblog-org will be updated in-place
  ~ resource "aws_s3_bucket" "www-shunblog-org" {
      + acl                         = "private"
        arn                         = "arn:aws:s3:::www.shunblog.org"
        bucket                      = "www.shunblog.org"
        bucket_domain_name          = "www.shunblog.org.s3.amazonaws.com"
        bucket_regional_domain_name = "www.shunblog.org.s3.amazonaws.com"
      + force_destroy               = false
        hosted_zone_id              = "Z3AQBSTGFYJSTF"
        id                          = "www.shunblog.org"
        region                      = "us-east-1"
        request_payer               = "BucketOwner"
        tags                        = {}
        website_domain              = "s3-website-us-east-1.amazonaws.com"
        website_endpoint            = "www.shunblog.org.s3-website-us-east-1.amazonaws.com"

        versioning {
            enabled    = false
            mfa_delete = false
        }

      - website {
          - error_document = "404.html" -> null
          - index_document = "index.html" -> null
        }
    }

  # module.aws-s3-bucket.aws_s3_bucket.www-shunkakinoki-com will be updated in-place
  ~ resource "aws_s3_bucket" "www-shunkakinoki-com" {
      + acl                         = "private"
        arn                         = "arn:aws:s3:::www.shunkakinoki.com"
        bucket                      = "www.shunkakinoki.com"
        bucket_domain_name          = "www.shunkakinoki.com.s3.amazonaws.com"
        bucket_regional_domain_name = "www.shunkakinoki.com.s3.amazonaws.com"
      + force_destroy               = false
        hosted_zone_id              = "Z3AQBSTGFYJSTF"
        id                          = "www.shunkakinoki.com"
        region                      = "us-east-1"
        request_payer               = "BucketOwner"
        tags                        = {}

        versioning {
            enabled    = false
            mfa_delete = false
        }
    }

Plan: 4 to add, 5 to change, 3 to destroy.
```

</details>

*Workflow: `Terraform Pull Request`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
